Revit 2024 API
ModelCurveArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ModelCurveArrayIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As ModelCurveArrayIterator
Visual C++
public:
virtual ModelCurveArrayIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the array.
See Also
ModelCurveArray Class
Autodesk.Revit.DB Namespace